//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль математической системы
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMathSettings.cs
*		Настройки модуля математической системы применительно к режиму разработки и редактору Unity.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Runtime.CompilerServices;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//---------------------------------------------------------------------------------------------------------------------
// Обеспечивает дружественность для сборки редакторов
[assembly: InternalsVisibleToAttribute("Assembly-CSharp-Editor")]
[assembly: InternalsVisibleToAttribute("Lotus.Unity.Math.Editor")]
//=====================================================================================================================
namespace Lotus
{
	namespace Maths
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Math
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения настроек модуля математической системы применительно к режиму разработки и редактору Unity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XMathEditorSettings
		{
#if UNITY_2017_1_OR_NEWER
			/// <summary>
			/// Путь в размещении меню редактора модуля математической системы (для упорядочивания)
			/// </summary>
			public const String MenuPath = XEditorSettings.MenuPlace + "Math/";
#endif
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================